sml2D10/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletBottom
    {
        //type            turbulentInlet;
        //referenceField  uniform (0.1 0 0);
        //fluctuationScale (0.002 0 0);        
        //type            fixedValue;
        //value           uniform (0.01 0 0);
        type            zeroGradient;
    }
    inletTop
    {
        //type            turbulentInlet;
        //referenceField  uniform (0.4 0 0);
        //fluctuationScale (0.002 0 0);
        //type            fixedValue;
        //value           uniform (0.01 0 0);
        type            zeroGradient;
    }
    outletBottom
    {
        //type            inletOutlet;
        //inletValue      uniform (0 0 0);
        //value           uniform (0 0 0);
        type            zeroGradient;
    }
    outletTop
    {
        //type            inletOutlet;
        //inletValue      uniform (0 0 0);
        //value           uniform (0 0 0);
        type            zeroGradient;
    }
    bottom
    {
        //type            freestream;
        //freestreamValue uniform (0.01 0 0);
        type            zeroGradient;
    }
    top
    {
        //type            freestream;
        //freestreamValue uniform (0.01 0 0);
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
