sml2D10/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 30e06;

boundaryField
{
    inletBottom
    {
        type            zeroGradient;        
    }
    inletTop
    {
        type            zeroGradient;        
    }
    outletBottom
    {
        //type            fixedValue;
        //value           uniform 30e06;
        type            zeroGradient;
    }
    outletTop
    {
        //type            fixedValue;
        //value           uniform 30e06;
        type            zeroGradient;
    }
    bottom
    {
        //type            freestreamPressure;
        //type            fixedValue;
        //value           uniform 30e06;
        type            zeroGradient;
    }
    top
    {
        //type            freestreamPressure;
        type            fixedValue;
        value           uniform 30e06;
        //type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
