sml2D10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inletBottom
    {
        type            patch;
        nFaces          5;
        startFace       180;
    }
    inletTop
    {
        type            patch;
        nFaces          5;
        startFace       185;
    }
    outletBottom
    {
        type            patch;
        nFaces          5;
        startFace       190;
    }
    outletTop
    {
        type            patch;
        nFaces          5;
        startFace       195;
    }
    bottom
    {
        type            patch;
        nFaces          10;
        startFace       200;
    }
    top
    {
        type            patch;
        nFaces          10;
        startFace       210;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       220;
    }
)

// ************************************************************************* //
