sml2D10/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

isothermal       yes;

nSpecies         3;
R_GAS            8.3144621;

P_thermo         30e06;

species (ma_vr as h2o);

phases (oil water);

rho1              rho1  [ 1 -3 0 0 0 0 0 ] 900;
rho0              rho0  [ 1 -3 0 0 0 0 0 ] 250;

mu1               mu1   [ 1 -1 -1 0 0 0 0 ] 7e-4;
mu0               mu0   [ 1 -1 -1 0 0 0 0 ] 3.5e-5;

lambda1           lambda1   [ 1 1 -3 -1 0 0 0 ] 0.1;
lambda0           lambda0   [ 1 1 -3 -1 0 0 0 ] 0.24;

Cp1               Cp1   [ 0 2 -2 -1 0 0 0 ] 5e03;
Cp0               Cp0   [ 0 2 -2 -1 0 0 0 ] 20e03;

MW1               MW1  [ 1 0 0 0 -1 0 0 ] 1000;
MW0               MW0  [ 1 0 0 0 -1 0 0 ] 18;

sigma             sigma [ 1 0 -2 0 0 0 0 ]  0;

D10               D10   [ 0 1 -2 0 0 0 0 ]  1e-8;
D11               D11   [ 0 1 -2 0 0 0 0 ]  1e-8;
D12               D12   [ 0 1 -2 0 0 0 0 ]  1e-8;
D00               D00   [ 0 1 -2 0 0 0 0 ]  1e-7;
D01               D01   [ 0 1 -2 0 0 0 0 ]  1e-7;
D02               D02   [ 0 1 -2 0 0 0 0 ]  1e-7;

Ys10              1;
Ys11              0;
Ys12              0;

Ys00              0;
Ys01              0;
Ys02              1;

T1MIN             683;
T1MAX             683;

T0MIN             683;
T0MAX             683;

n_flux_type       1;

ALPHA_BOUND_ERR   1e-15;
ALPHA_2PH_MIN     1e-09;
GRADALPHA_MIN     1e-03;
ALPHA_TOL         1e-12;
DIST_TOL          1e-15;
PT_DIST_TOL       1e-15;
SMALLEST_TET_VOL  1e-27;
SMALLEST_PHI      1e-21;
SMALLEST_ALPHA_FOR_YADV  1e-15;
SMALLEST_ALPHA_FOR_YDIFF 1e-15;
MIN_ALPHA_DIFF    1e-09;
A_INTFC_2PH_MIN   1e-03;
T_TOL             1e-3;
H_TOL             0.1;
Ts_TOL            100;
MASS_FRAC_TOL     1e-05;
MAX_BRENT_ITERS   512;
MAX_ITER_T        108;
MAX_ITER_Ts       1;

redist_alpha      no;
redist_C          no;

phi_interp_debug  no;
plic_debug        no;
plic_debug2       no;
plic_debugIR      no; 
plic_debugIR2     no;
plic_debugF       no;
plic_debugF2      no;
alpha_debug       no;
adv_debug         no;
adv_debug2        no;
grad_debug        no;
grad_debug2       no;
diff_debug        no;
diff_debug2       no;
ist_debug         yes;
ist_debug2        yes;

// ************************************************************************* //
